org/warehouse.org
#+TITLE: 仓库
# #+OPTIONS: toc:nil

#+begin_quote
希望有一天，我可以治好我的松鼠症
#+end_quote

* 教程
- [[https://racket-lang.org/][Racket]]
- [[https://zetcode.com/gui/pyqt5/][PyQt5教程]]
- [[https://graphviz.org/][Graphviz(dot画图)]]
- [[https://talk.linuxtoy.org/cli-tips/#1][高效使用 Linux 命令行]]
- [[http://docs.30c.org/dosbat/][Windows 批处理脚本学习教程]]

** Shell
- [[https://yanbin.blog/bash-zsh-call-emacs-vim-edit-current-command/][Bash/Zsh 下调用 Emacs/Vim 编辑当前命令]]

** Lazarus
- [[https://www.lazarus-ide.org/][Lazarus Homepage]]
- [[https://wiki.freepascal.org/Installing_Lazarus/zh_CN][Installing Lazarus/zh CN - Free Pascal wiki]]
- [[https://wiki.freepascal.org/Lazarus_Tutorial/zh_CN][Lazarus Tutorial/zh CN - Free Pascal wiki]]
  
** ArchLinux
- [[https://archlinux.org/][Arch Linux 官网]]
- [[https://wiki.archlinux.org/title/Installation_guide_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)][Installation guide (简体中文) - ArchWiki]]
- [[https://archlinuxstudio.github.io/ArchLinuxTutorial/#/][Arch Linux 安装使用教程]]
- [[https://shenyu.me/2020/04/10/arch-bios-install.html][Arch Linux (BIOS with MBR) 安装 | 沈煜的博客]]
- [[https://jingyan.baidu.com/article/154b4631aa70bb28ca8f4133.html][VMware Workstation 10 启动UEFI-百度经验]]

** Manjaro
- [[https://zhuanlan.zhihu.com/p/37924844][在Manjaro上配置国内源 - 知乎]]

* 开源镜像
- [[http://mirrors.163.com/][欢迎访问网易开源镜像站]]
- [[http://mirrors.ustc.edu.cn/][USTC(中科大)镜像站]]

* 自用壁纸链接
- [[https://bz.zzzmh.cn/index][极简壁纸]]
- [[https://ss.netnr.com/wallpaper][在线壁纸 NET牛人]]
- [[http://simpledesktops.com/][Simple Desktops]]
- [[https://www.wallpaperup.com/][WallpaperUP]]

* 关于Emacs
** 教程
- [[http://smacs.github.io/elisp/][Emacs Lisp 简明教程 - 水木社区Emacs版]]

** Eshell
- [[https://caiorss.github.io/Emacs-Elisp-Programming/Eshell.html][Eshell]]
- [[http://www.howardism.org/Technical/Emacs/eshell-fun.html][Eschewing Zshell for Emacs Shell]]
- [[https://tsdh.wordpress.com/2013/05/31/eshell-completion-for-git-bzr-and-hg/][Eshell completion for git, bzr, and hg | Tassilo's Blog]]
- [[http://blog.gnumonk.com/2012/07/effective-emacs-part1.html][We Live By Code: Effective emacs - Part:1]]

** Rime
- [[https://github.com/DogLooksGood/emacs-rime/issues/64][compilation on windows x64 · Issue #64 · DogLooksGood/emacs-rime]]
- [[https://emacs-china.org/t/linux-emacs-rime/12347/43][Linux下折腾emacs-rime - Emacs-general - Emacs China]]

** Menu bar
- [[https://wilkesley.org/~ian/xah/emacs/elisp_menu.html][Emacs: How to Add a Menu]]
- [[https://kitchingroup.cheme.cmu.edu/blog/2014/08/20/Creating-a-dynamic-menu-for-Emacs/][Creating a dynamic menu for Emacs]]

** Misc(待整理)
- [[https://www.slideshare.net/yukihiro_matz/how-emacs-changed-my-life][How Emacs changed my life - Ruby创始人]]
- [[http://baohaojun.github.io/blog/2016/04/13/0-system-config-how-does-it-work-and-how-to-use-it.html][system-config原理与使用的简要说明]]
- [[http://www.nituchao.com/os-tool/emacs-os-arch.html][从操作系统架构的角度谈Emacs的学习 - 泥土巢]]
- [[http://www.howardism.org/Technical/Emacs/capturing-content.html][Capturing Content for Emacs]]
- [[http://mjwall.com/blog/2013/10/04/how-i-use-emacs/][How I use Emacs - mjwall.com]]
- [[http://kimi.im/2021-01-28-emacs-inside-manjaro-wsl2-windows][在 Windows WSL2 中安装 Manjaro 通过 XServer 使用 Emacs]]
- [[https://christiantietze.de/posts/2021/06/emacs-center-window/][Automatically Center New Emacs Windows (Aka Frames) on Screen]]
- [[https://christiantietze.de/posts/2021/06/emacs-center-window-single-function/][Single Function to Center Emacs Window on Screen]]
- [[https://zhuanlan.zhihu.com/p/426804596][EAF pdf-viewer 助力文献阅读 - 知乎]]
- [[https://nschum.de/src/emacs/][An Emacser's Emacs extensions]]

