html/warehouse.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-05 二 22:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>仓库</title>
<meta name="author" content="yongfeizhai" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/style.css" />
<link rel="shortcut icon" href="favicon.gif" />
</head>
<body>
<div id="preamble" class="status">
<!-- -*- coding: utf-8 -*- -->
<div id="navList">
<ul>
<li><a href="./index.html">首页</a></li>
<li><a href="./blog.html">日志</a></li>
<li><a href="./test.html">图片</a></li>
<li><a href="./warehouse.html">仓库</a></li>
<li><a href="./about.html">关于</a></li>
</ul>
</div>
</div>
<div id="content" class="content">
<h1 class="title">仓库</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6309a46">1. 教程</a>
<ul>
<li><a href="#orgc7327d5">1.1. Shell</a></li>
<li><a href="#orgdb8adab">1.2. Lazarus</a></li>
<li><a href="#org0c211ae">1.3. ArchLinux</a></li>
<li><a href="#orgb705905">1.4. Manjaro</a></li>
</ul>
</li>
<li><a href="#org23614e6">2. 开源镜像</a></li>
<li><a href="#org6c92231">3. 自用壁纸链接</a></li>
<li><a href="#orgaede617">4. 关于Emacs</a>
<ul>
<li><a href="#orga89b9ee">4.1. 教程</a></li>
<li><a href="#orgdf09617">4.2. Eshell</a></li>
<li><a href="#org3041706">4.3. Rime</a></li>
<li><a href="#orgaa87d79">4.4. Menu bar</a></li>
<li><a href="#orge61db7d">4.5. Misc(待整理)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<blockquote>
<p>
希望有一天，我可以治好我的松鼠症
</p>
</blockquote>

<div id="outline-container-org6309a46" class="outline-2">
<h2 id="org6309a46"><span class="section-number-2">1.</span> 教程</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://racket-lang.org/">Racket</a></li>
<li><a href="https://zetcode.com/gui/pyqt5/">PyQt5教程</a></li>
<li><a href="https://graphviz.org/">Graphviz(dot画图)</a></li>
<li><a href="https://talk.linuxtoy.org/cli-tips/#1">高效使用 Linux 命令行</a></li>
<li><a href="http://docs.30c.org/dosbat/">Windows 批处理脚本学习教程</a></li>
</ul>
</div>

<div id="outline-container-orgc7327d5" class="outline-3">
<h3 id="orgc7327d5"><span class="section-number-3">1.1.</span> Shell</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://yanbin.blog/bash-zsh-call-emacs-vim-edit-current-command/">Bash/Zsh 下调用 Emacs/Vim 编辑当前命令</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdb8adab" class="outline-3">
<h3 id="orgdb8adab"><span class="section-number-3">1.2.</span> Lazarus</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="https://www.lazarus-ide.org/">Lazarus Homepage</a></li>
<li><a href="https://wiki.freepascal.org/Installing_Lazarus/zh_CN">Installing Lazarus/zh CN - Free Pascal wiki</a></li>
<li><a href="https://wiki.freepascal.org/Lazarus_Tutorial/zh_CN">Lazarus Tutorial/zh CN - Free Pascal wiki</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0c211ae" class="outline-3">
<h3 id="org0c211ae"><span class="section-number-3">1.3.</span> ArchLinux</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://archlinux.org/">Arch Linux 官网</a></li>
<li><a href="https://wiki.archlinux.org/title/Installation_guide_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)">Installation guide (简体中文) - ArchWiki</a></li>
<li><a href="https://archlinuxstudio.github.io/ArchLinuxTutorial/#/">Arch Linux 安装使用教程</a></li>
<li><a href="https://shenyu.me/2020/04/10/arch-bios-install.html">Arch Linux (BIOS with MBR) 安装 | 沈煜的博客</a></li>
<li><a href="https://jingyan.baidu.com/article/154b4631aa70bb28ca8f4133.html">VMware Workstation 10 启动UEFI-百度经验</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb705905" class="outline-3">
<h3 id="orgb705905"><span class="section-number-3">1.4.</span> Manjaro</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><a href="https://zhuanlan.zhihu.com/p/37924844">在Manjaro上配置国内源 - 知乎</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org23614e6" class="outline-2">
<h2 id="org23614e6"><span class="section-number-2">2.</span> 开源镜像</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://mirrors.163.com/">欢迎访问网易开源镜像站</a></li>
<li><a href="http://mirrors.ustc.edu.cn/">USTC(中科大)镜像站</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6c92231" class="outline-2">
<h2 id="org6c92231"><span class="section-number-2">3.</span> 自用壁纸链接</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://bz.zzzmh.cn/index">极简壁纸</a></li>
<li><a href="https://ss.netnr.com/wallpaper">在线壁纸 NET牛人</a></li>
<li><a href="http://simpledesktops.com/">Simple Desktops</a></li>
<li><a href="https://www.wallpaperup.com/">WallpaperUP</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgaede617" class="outline-2">
<h2 id="orgaede617"><span class="section-number-2">4.</span> 关于Emacs</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga89b9ee" class="outline-3">
<h3 id="orga89b9ee"><span class="section-number-3">4.1.</span> 教程</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="http://smacs.github.io/elisp/">Emacs Lisp 简明教程 - 水木社区Emacs版</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdf09617" class="outline-3">
<h3 id="orgdf09617"><span class="section-number-3">4.2.</span> Eshell</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><a href="https://caiorss.github.io/Emacs-Elisp-Programming/Eshell.html">Eshell</a></li>
<li><a href="http://www.howardism.org/Technical/Emacs/eshell-fun.html">Eschewing Zshell for Emacs Shell</a></li>
<li><a href="https://tsdh.wordpress.com/2013/05/31/eshell-completion-for-git-bzr-and-hg/">Eshell completion for git, bzr, and hg | Tassilo's Blog</a></li>
<li><a href="http://blog.gnumonk.com/2012/07/effective-emacs-part1.html">We Live By Code: Effective emacs - Part:1</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3041706" class="outline-3">
<h3 id="org3041706"><span class="section-number-3">4.3.</span> Rime</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li><a href="https://github.com/DogLooksGood/emacs-rime/issues/64">compilation on windows x64 · Issue #64 · DogLooksGood/emacs-rime</a></li>
<li><a href="https://emacs-china.org/t/linux-emacs-rime/12347/43">Linux下折腾emacs-rime - Emacs-general - Emacs China</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgaa87d79" class="outline-3">
<h3 id="orgaa87d79"><span class="section-number-3">4.4.</span> Menu bar</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li><a href="https://wilkesley.org/~ian/xah/emacs/elisp_menu.html">Emacs: How to Add a Menu</a></li>
<li><a href="https://kitchingroup.cheme.cmu.edu/blog/2014/08/20/Creating-a-dynamic-menu-for-Emacs/">Creating a dynamic menu for Emacs</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge61db7d" class="outline-3">
<h3 id="orge61db7d"><span class="section-number-3">4.5.</span> Misc(待整理)</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li><a href="https://www.slideshare.net/yukihiro_matz/how-emacs-changed-my-life">How Emacs changed my life - Ruby创始人</a></li>
<li><a href="http://baohaojun.github.io/blog/2016/04/13/0-system-config-how-does-it-work-and-how-to-use-it.html">system-config原理与使用的简要说明</a></li>
<li><a href="http://www.nituchao.com/os-tool/emacs-os-arch.html">从操作系统架构的角度谈Emacs的学习 - 泥土巢</a></li>
<li><a href="http://www.howardism.org/Technical/Emacs/capturing-content.html">Capturing Content for Emacs</a></li>
<li><a href="http://mjwall.com/blog/2013/10/04/how-i-use-emacs/">How I use Emacs - mjwall.com</a></li>
<li><a href="http://kimi.im/2021-01-28-emacs-inside-manjaro-wsl2-windows">在 Windows WSL2 中安装 Manjaro 通过 XServer 使用 Emacs</a></li>
<li><a href="https://christiantietze.de/posts/2021/06/emacs-center-window/">Automatically Center New Emacs Windows (Aka Frames) on Screen</a></li>
<li><a href="https://christiantietze.de/posts/2021/06/emacs-center-window-single-function/">Single Function to Center Emacs Window on Screen</a></li>
<li><a href="https://zhuanlan.zhihu.com/p/426804596">EAF pdf-viewer 助力文献阅读 - 知乎</a></li>
<li><a href="https://nschum.de/src/emacs/">An Emacser's Emacs extensions</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yongfeizhai</p>
<p class="date">Created: 2022-04-05 二 22:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
